# Знакомство с языком Python (семинары)
# Урок 2. Знакомство с Python. Продолжение
# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# - 0,56 -> 11
# Вариант 1: для строки
# summ = 0
# number = input('Введите вещественное число через точку (пример: 6.543): ')
# print(number)
# for i in number:
#     if i.isdigit():
#         summ += int(i)
# print(summ)
# Вариант 2: если вещественное число
# с вещественными цифрами проблемка :-) пришлось все равно переводить в текст
# summ = 0
# number = float(
#     input('Введите вещественное число через точку (пример: 6.543): '))
# number = str(number)
# for i in number:
#     if i.isdigit():
#         summ += int(i)
# print(summ)


# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


# Задайте список из k чисел последовательности (1 + 1\k)^k и выведите на экран их сумму.


# Задайте список из N элементов, заполненных числами из промежутка [-N, N].


# Найдите произведение элементов на указанных пользователем через пробел позициях.


# Реализуйте алгоритм перемешивания списка.
